app/controllers/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT * FROM "projects"

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "created_at", "butget", "updated_at", "description") VALUES('Prueba 1', '2010-07-28 21:02:48', 40, '2010-07-28 21:02:48', 'Prueba 1')

  def update
    @project = Project.find(params[:id])
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)